santorini_new/app/Http/Controllers/HomeController.php

select * from `transactions` order by `created_at` desc limit 20
select * from `sales` where `finalized_at` is null
---
    public function index()
    {
        $monthlyBalanceByMethod = $this->getMethodBalance()->get('monthlyBalanceByMethod');
        $monthlyBalance = $this->getMethodBalance()->get('monthlyBalance');

        $anualsales = $this->getAnnualSales();
        $anualclients = $this->getAnnualClients();
        $anualproducts = $this->getAnnualProducts();

        return view('dashboard', [
            'monthlybalance'            => $monthlyBalance,
            'monthlybalancebymethod'    => $monthlyBalanceByMethod,
            'lasttransactions'          => Transaction::latest()->limit(20)->get(),
            'unfinishedsales'           => Sale::where('finalized_at', null)->get(),

select * from `payment_methods` where `payment_methods`.`deleted_at` is null
select sum(`amount`) as aggregate from `transactions` where `payment_method_id` = 1 and month(`created_at`) = '04'
---
    public function getMethodBalance()
    {
        $methods = PaymentMethod::all();
        $monthlyBalanceByMethod = [];
        $monthlyBalance = 0;

        foreach ($methods as $method) {
            $balance = Transaction::findByPaymentMethodId($method->id)->thisMonth()->sum('amount');

select count(*) as aggregate from `sales` where year(`created_at`) = 2025 and month(`created_at`) = '01'
---
    public function getAnnualSales()
    {
        $sales = [];
        foreach(range(1, 12) as $i) {
            $monthlySalesCount = Sale::whereYear('created_at', Carbon::now()->year)->whereMonth('created_at', $i)->count();

select count(distinct client_id) as total from `sales` where year(`created_at`) = 2025 and month(`created_at`) = '01' limit 1
---
    public function getAnnualClients()
    {
        $clients = [];
        foreach(range(1, 12) as $i) {
            $monthclients = Sale::selectRaw('count(distinct client_id) as total')
                ->whereYear('created_at', Carbon::now()->year)
                ->whereMonth('created_at', $i)
                ->first();

select sum(`qty`) as aggregate from `sold_products` where year(`created_at`) = 2025 and month(`created_at`) = '01'
---
    public function getAnnualProducts()
    {
        $products = [];
        foreach(range(1, 12) as $i) {
            $monthproducts = SoldProduct::whereYear('created_at', Carbon::now()->year)->whereMonth('created_at', $i)->sum('qty');

select sum(`amount`) as aggregate from `transactions` where `type` = 'income' and year(`created_at`) = 2025 and month(`created_at`) = '04'
select sum(`amount`) as aggregate from `transactions` where `type` in ('expense', 'payment') and year(`created_at`) = 2025 and month(`created_at`) = '04'
---
    public function getMonthlyTransactions()
    {
        $actualmonth = Carbon::now();

        $lastmonths = [];
        $lastincomes = '';
        $lastexpenses = '';
        $semesterincomes = 0;
        $semesterexpenses = 0;

        foreach (range(1, 6) as $i) {
            array_push($lastmonths, $actualmonth->shortMonthName);

            $incomes = Transaction::where('type', 'income')
                ->whereYear('created_at', $actualmonth->year)
                ->WhereMonth('created_at', $actualmonth->month)
                ->sum('amount');

            $semesterincomes += $incomes;
            $lastincomes = round($incomes).','.$lastincomes;

            $expenses = abs(Transaction::whereIn('type', ['expense', 'payment'])
                ->whereYear('created_at', $actualmonth->year)
                ->WhereMonth('created_at', $actualmonth->month)
                ->sum('amount'));