santorini_new/app/Http/Controllers/SaleController.php

    public function index()
    {
        $sales = Sale::latest()->with('transactions')->paginate(25);
---
select * from `sales` order by `created_at` desc limit 25 offset 0
select * from `transactions` where `transactions`.`sale_id` in (599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624)
select count(*) as aggregate from `sales`

    public function create()
    {
        $clients = Client::all();
---
select * from `clients` where `clients`.`deleted_at` is null

    public function store(Request $request, Sale $model)
    {
        $existent = Sale::where('client_id', $request->get('client_id'))->where('finalized_at', null)->get();

        if($existent->count()) {
            return back()->withError('Já existe uma venda inacabada pertencente a esta mesa . <a href="'.route('sales.show', $existent->first()).'">Clique aqui para ir a ele</a>');
        }

        $sale = $model->create($request->all());
---
select * from `sales` where `client_id` = '1' and `finalized_at` is null
insert into `sales` (`user_id`, `client_id`, `updated_at`, `created_at`) values ('7', '1', '2025-04-06 13:04:19', '2025-04-06 13:04:19')

    public function finalize(Sale $sale)
    {
        $sale->total_amount = $sale->products->sum('total_amount');



        if($sale->total_amount ==0){
            return back()->withError("Fatura sem produtos !");
        }


        foreach ($sale->products as  $sold_product) {
            $product_name = $sold_product->product->name;
            $sold_product['name'] = $product_name;

            $product_stock = $sold_product->product->stock;

            if($sold_product->qty > $product_stock) return back()->withError("O produto '$product_name' não tem stock suficiente , no stock de   $product_stock unidades.");
        }

        foreach ($sale->products as $sold_product) {



            $sold_product->product->stock -= $sold_product->qty;
            $sold_product->product->save();
---
select * from `sold_products` where `sold_products`.`sale_id` = 631 and `sold_products`.`sale_id` is not null
update `products` set `stock` = 83, `products`.`updated_at` = '2025-04-06 13:14:57' where `id` = 3

        $sale->finalized_at = Carbon::now()->toDateTimeString();
        $sale->client->balance -= $sale->total_amount;

        $sale->save();
        $sale->client->save();
---
update `sales` set `total_amount` = 300, `finalized_at` = '2025-04-06 13:14:57', `sales`.`updated_at` = '2025-04-06 13:14:57' where `id` = 631
update `clients` set `balance` = -798530, `clients`.`updated_at` = '2025-04-06 13:14:57' where `id` = 1


        if($this->printCommand($sale)){

            Transaction::create(['title'=>'caixa', 'reference'=>Carbon::now(), 'amount'=> $ivaAmount, 'payment_method_id'=>1, 'type', 'client_id'=>$sale->client->id, 'user_id'=>Auth::user()->id, 'sale_id'=>$sale->id,'type'=>'income']);
---
insert into `transactions` (`title`, `reference`, `amount`, `payment_method_id`, `client_id`, `user_id`, `sale_id`, `type`, `updated_at`, `created_at`) values ('caixa', '2025-04-06 15:14:57', 348, 1, 1, 7, 631, 'income', '2025-04-06 15:14:57', '2025-04-06 15:14:57')

    public function addproduct(Sale $sale)
    {
        $products = Product::all();
---
select * from `products` where `products`.`deleted_at` is null

    public function storeproduct(Request $request, Sale $sale, SoldProduct $soldProduct)
    {
        $request->merge(['total_amount' => $request->get('price') * $request->get('qty')]);

        $soldProduct->create($request->all());
---
insert into `sold_products` (`sale_id`, `product_id`, `price`, `qty`, `total_amount`, `updated_at`, `created_at`) values ('637', '3', '300.00', '01', 300, '2025-04-06 13:46:17', '2025-04-06 13:46:17')

    public function editproduct(Sale $sale, SoldProduct $soldproduct)
    {
        $products = Product::all();
---
select * from `products` where `products`.`deleted_at` is null

    public function updateproduct(Request $request, Sale $sale, SoldProduct $soldproduct)
    {
        $request->merge(['total_amount' => $request->get('price') * $request->get('qty')]);

        $soldproduct->update($request->all());
---
update `sold_products` set `qty` = '1', `total_amount` = 300, `sold_products`.`updated_at` = '2025-04-06 07:12:20' where `id` = 1749